results/results_r5_large/results_r5_large_run2/oltp_read_write_t16/sysbench.log
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 16 tps: 40.59 qps: 829.55 (r/w/o: 583.39/44.69/201.46) lat (ms,95%): 733.00 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 16 tps: 39.30 qps: 793.73 (r/w/o: 555.62/42.30/195.81) lat (ms,95%): 733.00 err/s: 0.10 reconn/s: 0.00
[ 30s ] thds: 16 tps: 32.40 qps: 640.40 (r/w/o: 448.40/34.70/157.30) lat (ms,95%): 909.80 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 16 tps: 32.00 qps: 646.80 (r/w/o: 452.70/35.30/158.80) lat (ms,95%): 877.61 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 16 tps: 32.20 qps: 635.60 (r/w/o: 443.70/35.30/156.60) lat (ms,95%): 926.33 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 16 tps: 28.90 qps: 584.30 (r/w/o: 409.80/31.50/143.00) lat (ms,95%): 846.57 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 16 tps: 33.70 qps: 668.60 (r/w/o: 466.90/37.00/164.70) lat (ms,95%): 861.95 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 16 tps: 31.20 qps: 622.30 (r/w/o: 436.70/33.80/151.80) lat (ms,95%): 861.95 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 16 tps: 32.60 qps: 650.90 (r/w/o: 455.30/36.00/159.60) lat (ms,95%): 861.95 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 16 tps: 32.90 qps: 663.10 (r/w/o: 465.00/37.70/160.40) lat (ms,95%): 861.95 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 16 tps: 46.60 qps: 928.10 (r/w/o: 649.20/53.70/225.20) lat (ms,95%): 612.21 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 16 tps: 34.00 qps: 685.60 (r/w/o: 480.40/38.60/166.60) lat (ms,95%): 802.05 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            58534
        write:                           4621
        other:                           20464
        total:                           83619
    transactions:                        4180   (34.74 per sec.)
    queries:                             83619  (694.95 per sec.)
    ignored errors:                      1      (0.01 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      34.7394
    time elapsed:                        120.3244s
    total number of events:              4180

Latency (ms):
         min:                                  109.80
         avg:                                  460.00
         max:                                 1210.48
         95th percentile:                      831.46
         sum:                              1922790.69

Threads fairness:
    events (avg/stddev):           261.2500/3.83
    execution time (avg/stddev):   120.1744/0.09